app/controllers/api/v2/sessions_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'teste1@test.com' LIMIT 1
UPDATE `users` SET `current_sign_in_at` = '2018-06-04 09:37:48', `last_sign_in_at` = '2018-06-04 09:34:37', `sign_in_count` = 5, `updated_at` = '2018-06-04 09:37:48' WHERE `users`.`id` = 1
---
  def create
    user = User.find_by(email: session_params[:email])

    if user && user.valid_password?(session_params[:password])
      sign_in user, store: false
      user.generate_authentication_token!
      user.save