app/controllers/api/v2/tasks_controller.rb

    task = current_user.tasks.find(params[:id])
---
SELECT  `tasks`.* FROM `tasks` WHERE `tasks`.`user_id` = 7 AND `tasks`.`id` = 3 LIMIT 1

    task = current_user.tasks.build(task_params)
    if task.save
---
INSERT INTO `tasks` (`title`, `description`, `deadline`, `user_id`, `created_at`, `updated_at`) VALUES ('Teste1234', 'Teste de Descrição', '2018-05-18 23:45:00', 2, '2018-06-04 02:53:32', '2018-06-04 02:53:32')

    task = current_user.tasks.find(params[:id])

    if task.update_attributes(task_params)
---
SELECT  `tasks`.* FROM `tasks` WHERE `tasks`.`user_id` = 2 AND `tasks`.`id` = 3 LIMIT 1
UPDATE `tasks` SET `description` = 'Teste', `deadline` = '2018-06-21 18:18:00', `updated_at` = '2018-06-03 21:18:27' WHERE `tasks`.`id` = 1

    task = current_user.tasks.find(params[:id])
    task.destroy
---
SELECT  `tasks`.* FROM `tasks` WHERE `tasks`.`user_id` = 2 AND `tasks`.`id` = 3 LIMIT 1
DELETE FROM `tasks` WHERE `tasks`.`id` = 3