app/controllers/api/v2/users_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`uid` = 'bruno.silveira@brunoss.com.br' LIMIT 1
---
  def show
    @user = User.find(params[:id])

SELECT  `users`.* FROM `users` WHERE `users`.`uid` = 'bruno.silveira@brunoss.com.br' LIMIT 1
UPDATE `users` SET `cpf` = '02492510000', `birthday` = '2018-06-05', `city` = 'Pelotas', `region` = 'RS', `company` = 'AIS', `occupation` = 'Comercial', `updated_at` = '2018-06-05 15:10:04' WHERE `users`.`id` = 2
---
  def update
    user = User.find(params[:id])

    if user.update(user_params)