app/controllers/api/v1/sessions_controller.rb

  def create
    user = User.find_by(email: session_params[:email])

    if user && user.valid_password?(session_params[:password])
      sign_in user, store: false
      user.generate_authentication_token!
      user.save
---
SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'joao@dasilva.com' LIMIT 1
UPDATE `users` SET `current_sign_in_at` = '2018-05-29 03:05:46', `last_sign_in_at` = '2018-05-29 03:05:46', `current_sign_in_ip` = '127.0.0.1', `last_sign_in_ip` = '127.0.0.1', `sign_in_count` = 1, `updated_at` = '2018-05-29 03:05:46' WHERE `users`.`id` = 1