app/controllers/api/v1/tasks_controller.rb

    task = current_user.tasks.find(params[:id])
---
SELECT  `tasks`.* FROM `tasks` WHERE `tasks`.`user_id` = 7 AND `tasks`.`id` = 3 LIMIT 1

    task = current_user.tasks.build(task_params)
    if task.save
---
INSERT INTO `tasks` (`title`, `description`, `deadline`, `user_id`, `created_at`, `updated_at`) VALUES ('titulo da tarefa', 'minha descrição', '2018-05-15 22:00:00', 7, '2018-04-20 00:22:51', '2018-04-20 00:22:51')

    task = current_user.tasks.find(params[:id])

    if task.update_attributes(task_params)
---
SELECT  `tasks`.* FROM `tasks` WHERE `tasks`.`user_id` = 7 AND `tasks`.`id` = 2 LIMIT 1
UPDATE `tasks` SET `deadline` = NULL, `updated_at` = '2018-04-20 00:27:33' WHERE `tasks`.`id` = 2