app/controllers/api/v1/users_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def show
    @user = User.find(params[:id])

INSERT INTO `users` (`email`, `encrypted_password`, `created_at`, `updated_at`, `auth_token`, `uid`, `tokens`) VALUES ('teste1@test.com', '$2a$11$xsXAomcH3zZZjhLi2OX76e2MW6CkNhiihfMBa0xXGnRoPqZZqrk3S', '2018-05-29 03:05:32', '2018-05-29 03:05:32', 'j595XjHx-Az8LwCU3Hpn', 'teste1@test.com', '{}')
---
  def create
    user = User.new(user_params)

    if user.save

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
UPDATE `users` SET `email` = 'test4@test.com', `updated_at` = '2018-04-18 02:14:47' WHERE `users`.`id` = 2
---
  def update
    user = User.find(params[:id])

    if user.update(user_params)

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 2
---
  def destroy
    user = User.find(params[:id])
    user.destroy